tap "homebrew/bundle"
tap "homebrew/services"
tap "infisical/get-cli"
tap "noahgorstein/tap"
brew "bat"
brew "cava"
brew "chezmoi"
brew "cloudflared"
brew "colima", restart_service: true
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker"
brew "eza"
brew "fzf"
brew "git"
brew "glow"
brew "gping"
brew "imagemagick"
brew "jless"
brew "lazygit"
brew "ncspot"
brew "neovim"
brew "nushell"
brew "spotifyd"
brew "starship"
brew "zoxide"
brew "zsh"
brew "infisical/get-cli/infisical"
brew "noahgorstein/tap/jqp"
cask "visual-studio-code"
vscode "farosystemappender constructor"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alexcvzz.vscode-sqlite"
vscode "antyos.openscad"
vscode "astro-build.astro-vscode"
vscode "bajcmartinez.jwt-vscode"
vscode "bierner.emojisense"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.lit-html"
vscode "bierner.markdown-checkbox"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "franneck94.c-cpp-runner"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grammyjs.grammyjs"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashrock.kivi"
vscode "huibizhang.codesnap-plus"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jaaxxx.cloudflare-vscode-devtools"
vscode "jackmacwindows.craftos-pc"
vscode "jackmacwindows.vscode-computercraft"
vscode "janisdd.vscode-edit-csv"
vscode "jinliming2.vscode-go-template"
vscode "lancewilhelm.horizon-extended"
vscode "lehwark.htmx-literals"
vscode "lemmmy.computercraft-extension-pack"
vscode "markosth09.color-picker"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "netcorext.uuid-generator"
vscode "nuxtr.nuxtr-vscode"
vscode "oderwat.indent-rainbow"
vscode "orsenkucher.vscode-graphql"
vscode "orta.vscode-twoslash"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "rpinski.shebang-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "sporto.rails-go-to-spec"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "ultram4rine.vscode-choosealicense"
vscode "undefined_publisher.vitale-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wequick.coverage-gutters"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
