tap "homebrew/bundle"
tap "homebrew/services"
tap "infisical/get-cli"
tap "noahgorstein/tap"
brew "bat"
brew "cava"
brew "chezmoi"
brew "cloudflared"
brew "colima", restart_service: true
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker"
brew "eza"
brew "fzf"
brew "git"
brew "glow"
brew "gping"
brew "imagemagick"
brew "jless"
brew "lazygit"
brew "ncspot"
brew "neovim"
brew "nushell"
brew "spotifyd"
brew "starship"
brew "zoxide"
brew "zsh"
brew "infisical/get-cli/infisical"
